/* 
  หน้า RegisterScreen.js เป็นหน้าที่ใช้สำหรับให้ผู้ใช้ลงทะเบียนออนไลน์
*/

//  import ไลบรารี่
import React, { useState, useEffect } from 'react'
import {
    Text,
    View,
    TouchableOpacity,
    Modal,
    Pressable,
    ScrollView,
    Keyboard,
    Platform
} from 'react-native'
import AsyncStorage from '@react-native-async-storage/async-storage'
import { TextInputMask } from 'react-native-masked-text'
import AppAlert from '../components/AppAlert'
import axios from 'axios'
import NetInfo from '@react-native-community/netinfo'
// import { Popover } from 'native-base'
import { APP_KEY, COOP_NAME, APP_NAME } from '../environment'
import { loginStyles } from '../styles/login'
import LoginLayout from '../components/layouts/LoginLayout'
import Button from '../components/Button'
import AntDesign from 'react-native-vector-icons/AntDesign'
import { addScreenshotListener } from 'react-native-detector'

const RegisterScreen = ({ navigation }) => {
    //  ส่วนของการประกาศตัวแปรเริ่มต้น
    const [keyAuthen, setKeyAuthen] = useState(null)
    const [shareNumber, setShareNumber] = useState(null)
    const [idCardNumber, setIdCardNumber] = useState(null)
    const [phoneNumber, setPhoneNumber] = useState(null)
    const [modalVisible, setModalVisible] = useState(false)
    const [showAlert, setShowAlert] = useState(false)
    const [alertMessage, setAlertMessage] = useState('')
    const [alertType, setAlertType] = useState('normal')
    const [API_URL, setAPI_URL] = useState(null)
    const [isConnect, setIsConnect] = useState(false)

    //  ฟังก์ชันนี้ทำงานเมื่อกดปุ่ม "ลงทะเบียน"
    const register = () => {
        if (isConnect) {
            if (Platform.OS !== 'ios') {
                setShowAlert(true)
            }

            if (shareNumber && idCardNumber && phoneNumber) {
                if (shareNumber.length !== 12) {
                    setShowAlert(true)
                    setAlertMessage('กรุณากรอกเลขบัญชีหุ้น 10 หลัก')
                } else if (idCardNumber.length !== 13) {
                    setShowAlert(true)
                    setAlertMessage('กรุณากรอกเลขบัตรประชาชน 13 หลัก')
                } else if (phoneNumber.length !== 10) {
                    setShowAlert(true)
                    setAlertMessage('กรุณากรอกเบอร์โทรศัพท์ 10 หลัก')
                } else {
                    axios
                        .post(`${API_URL}/Register`, {
                            MEM: shareNumber,
                            MOBILE_TEL: phoneNumber,
                            ID_CARD: idCardNumber
                        }, {
                            headers: {
                                APP_KEY: APP_KEY,
                                Authorization: `App ${keyAuthen}`
                            }
                        })
                        .then(async (response) => {
                            // console.log(response.data)
                            if (response.data.code === 10) {
                                // หมายเลขนี้ลงทะเบียนแล้ว
                                try {
                                    await AsyncStorage.setItem('token', response.data.item)
                                } catch (err) {
                                    console.log(err)
                                }
                                setShowAlert(true)
                                setAlertMessage(response.data.message)
                                setAlertType('warning')
                            } else if (response.data.code === 20) {
                                // ลงทะเบียนแล้วแต่ยังไม่ได้ใส่ pin
                                try {
                                    await AsyncStorage.setItem('token', response.data.item)
                                    await AsyncStorage.setItem('token', response.data.item)
                                    await AsyncStorage.setItem('confirmShareNumber', response.data.itemdetail)
                                } catch (err) {
                                    console.log(err)
                                }
                                setShowAlert(true)
                                setAlertMessage(response.data.message)
                                setAlertType('warning')
                            } else if (response.data.code === 30) {
                                // ลงทะเบียนใหม่
                                try {
                                    await AsyncStorage.setItem('token', response.data.item)
                                    await AsyncStorage.setItem('API_KEY', response.data.itemdetail)
                                } catch (err) {
                                    console.log(err)
                                }

                                //  เปิด modal รายละเอียดข้อตกลงของแอพ
                                setModalVisible(true)

                                setAlertMessage('')
                                setIdCardNumber(null)
                                setPhoneNumber(null)
                            } else {
                                setShowAlert(true)
                                setAlertMessage(response.data.message !== null ? response.data.message : 'กรุณาทำรายการใหม่')
                            }
                        })
                        .catch(err => {
                            if (err.message === 'Network Error') {
                                setShowAlert(true)
                                setAlertMessage('ไม่สามารถทำรายการได้ กรุณาลองใหม่อีกครั้ง')
                            }
                        })
                }
            } else {
                setShowAlert(true)
                setAlertMessage('กรุณากรอกข้อมูลให้ครบ')
            }
        } else {
            setShowAlert(true)
            setAlertMessage('กรุณาตรวจสอบการเชื่อมต่ออินเทอร์เน็ตและลองใหม่อีกครั้ง')
        }
    }

    //  ฟังก์ชันนี้ทำงานเมื่อผู้ใช้กดตกลงใน alert
    const onConfirmPressed = () => {
        setAlertMessage('')
        setShowAlert(false)

        //  ถ้า alertType = 'warning' หมายถึง 'หมายเลขนี้ลงทะเบียนแล้ว' จะลิ้งค์ไปหน้า 'Login'
        if (alertType === 'warning') {
            setAlertType('normal')
            navigation.navigate('Login')
        }
    }

    useEffect(() => {
        const unsubscribe = NetInfo.addEventListener((state) => {
            setIsConnect(state.isInternetReachable)
        })

        return () => {
            unsubscribe()
        }
    }, [isConnect])

    useEffect(() => {
        //  ดึงค่า KEY_AUTHEN จาก AsyncStorage
        const getKey_Authen = async () => {
            try {
                const StoreAPI_URL = await AsyncStorage.getItem('StoreAPI_URL')
                const keyAuthen = await AsyncStorage.getItem('KEY_AUTHEN')
                if (keyAuthen !== null) {
                    setKeyAuthen(keyAuthen)
                }
                if (StoreAPI_URL !== null) {
                    setAPI_URL(StoreAPI_URL)
                }
            } catch (err) {
                console.log(err)
            }
        }

        getKey_Authen()
    }, [])

    useEffect(() => {
        const userDidScreenshot = () => {
            navigation.reset({
                index: 0,
                routes: [{ name: 'ScreenshotWarning' }]
            })
        }

        const unsubscribe = addScreenshotListener(userDidScreenshot)

        return () => {
            Platform.OS === 'ios' && unsubscribe()
        }
    }, [])

    //  return คือส่วนของการแสดงผลของหน้านี้
    return (
        <LoginLayout onPress={() => Keyboard.dismiss()}>
            <Text style={loginStyles.title}>สมัครใช้งานออนไลน์</Text>

            <View style={loginStyles.inputView} >
                <TextInputMask
                    type={'custom'}
                    placeholder='เลขบัญชีหุ้น 10 หลัก'
                    keyboardType='numeric'
                    placeholderTextColor='#003f5c'
                    options={{
                        mask: '999-99-99999'
                    }}
                    value={shareNumber}
                    onChangeText={text => {
                        setShareNumber(text)
                    }}
                    style={loginStyles.inputText}
                />

                {/* <Popover trigger={triggerProps => {
                    return <TouchableOpacity {...triggerProps} style={loginStyles.eye}>
                        <AntDesign name='questioncircle' size={20} color='#69b1ff' />
                    </TouchableOpacity>
                }}>
                    <Popover.Content accessibilityLabel='Delete Customerd' w='56'>
                        <Popover.Arrow />
                        <Popover.Body>
                            <Text style={loginStyles.popoverMsg}>หมายเลขหุ้น 10 หลัก ที่อยู่หน้าสมุดเงินฝากหุ้น (เล่มสีน้ำเงิน) ตัวอย่างเช่น 001-01-XXXXX</Text>
                        </Popover.Body>
                    </Popover.Content>
                </Popover> */}
            </View>

            <View style={loginStyles.inputView} >
                <TextInputMask
                    type={'custom'}
                    placeholder='เลขบัตรประชาชน 13 หลัก'
                    keyboardType='numeric'
                    placeholderTextColor='#003f5c'
                    options={{
                        mask: '9999999999999'
                    }}
                    value={idCardNumber}
                    onChangeText={text => {
                        setIdCardNumber(text)
                    }}
                    style={loginStyles.inputText}
                />
            </View>

            <View style={loginStyles.inputView} >
                <TextInputMask
                    type={'custom'}
                    placeholder='เบอร์โทรศัพท์ 10 หลัก'
                    keyboardType='numeric'
                    placeholderTextColor='#003f5c'
                    options={{
                        mask: '9999999999'
                    }}
                    value={phoneNumber}
                    onChangeText={text => {
                        setPhoneNumber(text)
                    }}
                    style={loginStyles.inputText}
                />
            </View>

            {/* เมื่อกดปุ่ม 'ลงทะเบียน' ให้เรียกใช้ฟังก์ชัน register() */}
            <Button title='ลงทะเบียน' onPress={() => register()} />

            <View style={{ flexDirection: 'row', top: 30 }}>
                <Text style={loginStyles.registerBtn}>สมัครสมาชิกแล้ว?</Text>
                <TouchableOpacity onPress={() => navigation.navigate('Login')}>
                    <Text style={[loginStyles.registerBtn, { marginLeft: 5, textDecorationLine: 'underline' }]}>เข้าสู่ระบบ</Text>
                </TouchableOpacity>
            </View>

            {/* Modal นี้จะโชว์เมื่อผู้ใช้อยู่ในสถานะ 'ลงทะเบียนใหม่' (code = 30) */}
            <Modal
                animationType='slide'
                transparent={true}
                visible={modalVisible}
                onRequestClose={() => {
                    setModalVisible(!modalVisible)
                }}
            >
                <View style={loginStyles.centeredView}>
                    <View style={loginStyles.modalView}>
                        <ScrollView>
                            <Text style={[loginStyles.modalText, { fontFamily: 'Sarabun-Medium', textAlign: 'center' }]}>สมัครใช้บริการออนไลน์</Text>
                            <Text style={[loginStyles.modalText, { fontFamily: 'Sarabun-Medium' }]}>ข้อกำหนด และเงื่อนไขการให้บริการ</Text>

                            <Text style={loginStyles.modalText}>ผู้ใช้บริการตกลงใช้บริการ {APP_NAME} หรือชื่ออื่นที่สหกรณ์พิจารณาเปลี่ยนแปลงตามที่สหกรณ์เห็นสมควร (ซึ่งต่อไปนี้จะเรียกว่า “บริการ”) กับ {COOP_NAME} (ซึ่งต่อไปนี้จะเรียกว่า “สหกรณ์”) ตามรายละเอียดที่สหกรณ์กำหนด โดยตกลงผูกพันและปฏิบัติตามข้อกำหนดและเงื่อนไขการใช้บริการดังต่อไปนี้</Text>
                            <Text style={loginStyles.modalText}>1. สหกรณ์เปิดให้บริการ {APP_NAME} สำหรับสมาชิกที่อายุตั้งแต่ 20 ปีขึ้นไป</Text>
                            <Text style={loginStyles.modalText}>2. ผู้ใช้บริการจะต้องเป็นสมาชิกสหกรณ์</Text>
                            <Text style={loginStyles.modalText}>3. ผู้ใช้บริการสามารถใช้บริการผ่านช่องทาง โทรศัพท์มือถือ หรือแท็บเล็ตในเครือข่ายที่รองรับและสามารถเชื่อมต่อกับบริการนี้ได้ ทั้งแบบระบบเติมเงิน (Pre-Paid) หรือระบบจ่ายรายเดือน (Post-Paid)</Text>
                            <Text style={loginStyles.modalText}>4. ผู้ใช้บริการที่สมัครใช้บริการผ่านสาขาของสหกรณ์ ผ่านเวปไซต์ และผ่านทางโทรศัพท์มือถือหรือแท็บเล็ตแบบออนไลน์ โดยผู้ใช้บริการต้องกรอกข้อมูลการสมัครใช้บริการครบถ้วนและถูกต้อง ผู้ใช้บริการสามารถใช้บริการได้ทุกรายการ ได้แก่ สอบถามยอดเงินคงเหลือในบัญชี สอบถามข้อมูลสมาชิก ยอดหุ้น เงินฝาก สินเชื่อ โอนเงิน ชำระเงินและอื่นๆ การสมัครจะมีผลสมบูรณ์ต่อเมื่อผู้ใช้บริการได้รับข้อความ SMS ผ่านทางโทรศัพท์ตามหมายเลขที่ได้ให้ไว้กับสหกรณ์ หรือข้อความผ่านช่องทางอื่นใดตามที่สหกรณ์กำหนดเพื่อการยืนยันการสมัคร</Text>
                            <Text style={loginStyles.modalText}>5. การใช้รหัสผ่าน (PIN) และ/หรือ รหัส One Time Password (OTP) และ/หรือเครื่องมืออื่นใดที่ผู้ใช้บริการใช้เป็นเครื่องมือในการ Log in เข้าสู่บริการ {APP_NAME} เพื่อใช้บริการต่างๆ ซึ่งไม่จำกัดเฉพาะการโอนเงินเข้าหรือออกจากบัญชี ซึ่งต่อไปนี้ หากไม่เรียกคำใดคำหนึ่งเป็นการเฉพาะเจาะจงแล้วจะรวมเรียกว่า “เครื่องมือการโอนเงิน”</Text>
                            <Text style={[loginStyles.modalText, { marginLeft: 25 }]}>5.1 เมื่อผู้ใช้บริการได้รับอนุมัติให้ใช้บริการแล้ว ผู้ใช้บริการจะต้องกำหนดรหัสผ่าน (PIN) 6 หลักเพื่อใช้สำหรับการใช้บริการ</Text>
                            <Text style={[loginStyles.modalText, { marginLeft: 25 }]}>5.2 ผู้ใช้บริการจะต้องเก็บรักษาเครื่องมือการโอนเงินไว้ในที่ปลอดภัยและถือเป็นความลับเฉพาะ ตัวของผู้ใช้บริการรายนั้นเท่านั้น การเปิดเผยเครื่องมือการโอนเงินถือเป็นการปฏิบัติผิดข้อกำหนดและเงื่อนไขการใช้บริการนี้ หากเกิดความเสียหายประการใดจากการที่ผู้ใช้บริการเปิดเผยหรือกระทำการใดๆ จนทำให้เครื่องมือการโอนเงินสูญหายผู้ใช้บริการจะต้องรับผิดชอบในความเสียหายนั้น ทั้งนี้ผู้ใช้บริการสามารถเปลี่ยนแปลงรหัสผ่าน (PIN) ได้ด้วยตัวเองตลอดเวลา โดยไม่ต้องแจ้งให้สหกรณ์ทราบ</Text>
                            <Text style={[loginStyles.modalText, { marginLeft: 25 }]}>5.3 ในกรณีที่เครื่องมือการโอนเงินเกิดความสูญหาย/ถูกโจรกรรม/ถูกระงับเนื่องจากผู้ใช้บริการระบุรหัสผ่าน (PIN) ไม่ถูกต้องติดต่อกันตามจำนวนครั้งที่สหกรณ์กำหนด/ผู้ใช้บริการลืมรหัสผ่าน (PIN) หรือครบกำหนดเวลาที่ต้องเปลี่ยน ผู้ใช้บริการสามารถติดต่อสหกรณ์ที่ Call Center หมายเลข 074-799003 ในเวลาทำการ</Text>
                            <Text style={[loginStyles.modalText, { marginLeft: 25 }]}>5.4 ผู้ใช้บริการสามารถอายัดหรือระงับการใช้เครื่องมือการโอนเงินหรือการโอนเงินที่มีข้อตกลงล่วงหน้า หรือระงับการใช้บริการได้ โดยติดต่อสหกรณ์ที่ Call Center หมายเลข 074-799003 ในเวลาทำการ เพื่อดำเนินการตามขั้นตอนที่สหกรณ์กำหนดโดยสหกรณ์จะเป็นผู้ดำเนินการ การอายัดหรือระงับการใช้เครื่องมือการโอนเงินหรือการระงับการใช้บริการ จะดำเนินการภายใน 24 ชั่วโมงนับตั้งแต่เวลาที่สหกรณ์ได้รับคำสั่งหรือรับแจ้งจากผู้ใช้บริการครบถ้วน</Text>
                            <Text style={loginStyles.modalText}>6. การกระทำใดๆ ซึ่งรวมถึงการสมัครใช้บริการต่างๆ การตกลงยอมรับ การแก้ไข เปลี่ยนแปลง เพิ่มเติม บริการ/อัตราค่าธรรมเนียม/ข้อกำหนดและเงื่อนไขของการใช้บริการ ที่สหกรณ์ได้แจ้งให้ทราบผ่านช่องทางต่างๆ ไม่ว่าจะเป็นการกระทำของผู้ใช้บริการเองก็ดีหรือเป็นการกระทำของบุคคลอื่นใดก็ดี หากได้กระทำไปโดยการใช้เครื่องมือการโอนเงินแล้ว ผู้ใช้บริการตกลงให้ถือว่าถูกต้องสมบูรณ์นับตั้งแต่เวลาที่มีการยืนยันการทำธุรกรรม และให้มีผลผูกพันผู้ใช้บริการเสมือนหนึ่งได้กระทำโดยผู้ใช้บริการเอง รวมทั้งให้ถือว่าเป็นการที่ผู้ใช้บริการได้ลงลายมือชื่ออิเล็กทรอนิกส์ไว้ให้แก่สหกรณ์เพื่อเป็นหลักฐานในการทำธุรกรรมผ่านบริการในครั้งนั้นๆ โดยถูกต้องสมบูรณ์แล้ว และตกลงให้สหกรณ์สามารถใช้ข้อมูลการทำธุรกรรมดังกล่าวเป็นต้นฉบับเอกสารที่ใช้เป็นหลักฐานพยานในการพิสูจน์ว่าผู้ใช้บริการได้ทำธุรกรรมนั้น และใช้ในการดำเนินการทางกฎหมายได้ทุกประการ ทั้งนี้ผู้ใช้บริการตกลงยอมรับและรับทราบถึงความเสี่ยงที่เกี่ยวเนื่องกับการใช้บริการผ่านช่องทางอิเล็กทรอนิกส์ เนื่องจากผู้ใช้บริการสามารถทำธุรกรรมด้วยตนเองได้โดยไม่จำเป็นต้องมีเอกสาร หรือหลักฐานอื่นใดยืนยันเพิ่มเติม และ/หรือ มอบให้แก่สหกรณ์อีกแต่ประการใด เว้นแต่รายการที่สหกรณ์กำหนดให้ต้องทำเอกสารหรือหลักฐานเพิ่มเติมเพื่อให้ถูกต้องตามวิธีการ และประเพณีของสหกรณ์ในเรื่องนั้นๆ ทั้งนี้ผู้ใช้บริการต้องตรวจสอบยอดเงินภายหลังจากการทำรายการทุกครั้ง โดยผู้ใช้บริการยินยอมรับผิดชอบต่อการทำธุรกรรมดังกล่าวทุกประการ</Text>
                            <Text style={loginStyles.modalText}>7. การผูกบัญชีเงินฝากออมทรัพย์วาดีอะห์ หรือบัญชีเงินฝากมูฎอรอบะฮฺทั่วไป สามารถผูกได้กับหมายเลขโทรศัพท์มือถือหมายเลขเดียวเท่านั้นแต่หมายเลขโทรศัพท์มือถือหมายเลขเดียวสามารถผูกได้กับหลายบัญชี โดยขึ้นอยู่กับบัญชีที่ใช้สมัครบริการ</Text>
                            <Text style={loginStyles.modalText}>8. ผู้ใช้บริการยอมรับว่าการใช้บริการสามารถโอนเงินไปยังบัญชีบุคคลอื่น โอนเงินชำระค่าหุ้น โอนเงินชำระสินเชื่อ ตามเงื่อนไขที่สหกรณ์กำหนด</Text>
                            <Text style={loginStyles.modalText}>9. การใช้บริการชำระเงินและ/หรือโอนเงิน สหกรณ์จะทำการหักเงินจากบัญชีตามจำนวนเงินที่ระบุพร้อมค่าธรรมเนียมจากบัญชีของผู้ใช้บริการ และเงินจะถูกโอนเข้าบัญชีผู้รับเงิน/ผู้รับโอนเงินทันที หลังจากที่ผู้ใช้บริการได้ทำรายการ</Text>
                            <Text style={loginStyles.modalText}>10. กรณีที่ผู้ใช้บริการต้องการชำระเงินโดยใช้รหัสคิวอาร์ (“QR Code”) ผู้ใช้บริการต้องสร้าง QR Code ภายใต้บริการ {APP_NAME} โดยระบุข้อมูลเลขที่สมาชิก และเลขที่บัญชีเงินฝาก/เลขที่สัญญาสินเชื่อ ของผู้ใช้บริการให้ถูกต้อง และเมื่อสร้าง QR Code เรียบร้อยแล้ว ผู้ใช้บริการจึงสามารถนำไปชำระเงินโดยใช้ QR Code ได้</Text>
                            <Text style={loginStyles.modalText}>11. ผู้ใช้บริการยอมรับว่าการให้บริการตั้งค่ารูปภาพในโทรศัพท์มือถือของผู้ใช้บริการให้แสดงผลในส่วนของข้อมูลส่วนตัวของผู้ใช้บริการ ในส่วนข้อมูลของผู้รับชำระเงิน/ผู้รับโอนเงินในส่วนของพื้นหลังหน้าจอการทำงานตลอดจนการแสดงรูปภาพต่างๆ ที่ลูกค้ากำหนดและเลือกรูปภาพที่ใช้แสดงด้วยตัวผู้ใช้บริการเอง ผู้ใช้บริการตกลงว่าภาพที่แสดงผลในโทรศัพท์มือถือไม่มีลักษณะหรือก่อให้เกิดภาพสัญลักษณ์ หรือเครื่องหมายตามตัวอย่างดังต่อไปนี้</Text>
                            <Text style={[loginStyles.modalText, { marginLeft: 25 }]}>11.1 รูปภาพที่มีลิขสิทธิ์ของผู้อื่น</Text>
                            <Text style={[loginStyles.modalText, { marginLeft: 25 }]}>11.2 รูปภาพที่ไม่ได้รับความยินยอมจากบุคคลในภาพหรือภาพส่วนบุคคล</Text>
                            <Text style={[loginStyles.modalText, { marginLeft: 25 }]}>11.3 รูปภาพที่ก่อให้เกิดความแตกแยก หรือมีประเด็นทางการเมือง</Text>
                            <Text style={[loginStyles.modalText, { marginLeft: 25 }]}>11.4 รูปภาพที่ไม่สุภาพ ไม่เหมาะสม หรือยั่วยวน ลามกอนาจาร</Text>
                            <Text style={[loginStyles.modalText, { marginLeft: 25 }]}>11.5 รูปภาพดารานักแสดง นักดนตรี บุคคลผู้มีชื่อเสียงหรือนักกีฬาทั้งนี้เว้นแต่เป็นบุคคลที่ทำงานให้กับโปรแกรม Co-branding ที่ได้รับอนุญาตแล้ว</Text>
                            <Text style={[loginStyles.modalText, { marginLeft: 25 }]}>11.6 รูปภาพที่ขัดต่อความเรียบร้อยของประชาชนหรือทางวัฒนธรรมหรือศาสนา</Text>
                            <Text style={[loginStyles.modalText, { marginLeft: 25 }]}>11.7 รูปภาพที่เกี่ยวข้องกับการพนันหรือเครื่องดื่มแอลกอฮอล์ทุกประเภทและบุหรี่</Text>
                            <Text style={[loginStyles.modalText, { marginLeft: 25 }]}>11.8 เครื่องหมายสัญลักษณ์ประเทศพระบรมฉายาลักษณ์หรือพระบรมสาทิสลักษณ์ของพระมหากษัตริย์และพระราชินีหรือราชวงศ์</Text>
                            <Text style={[loginStyles.modalText, { marginLeft: 25 }]}>11.9 เครื่องหมายของส่วนราชการต่างๆ ผู้รับบริการตกลงว่าข้อมูล รูปภาพ สัญลักษณ์ หรือเครื่องหมายใดๆที่เลือกเข้ามาในบริการนี้ผู้ใช้บริการเป็นเจ้าของข้อมูล รูปภาพ สัญลักษณ์ เครื่องหมายการค้าเครื่องหมายบริการ เจ้าของลิขสิทธิ์ และ/หรือมีสิทธิโดยชอบธรรมในการส่งสิ่งดังกล่าวเข้าสู่บริการหากผู้ใช้บริการนำข้อมูล รูปภาพ สัญลักษณ์หรือเครื่องหมายใดๆ ของบุคคลอื่นมาใช้โดยไม่ได้รับอนุญาตหรือโดยผิดกฎหมาย ผู้ใช้บริการตกลงรับผิดชอบในความเสียหายที่เกิดขึ้นทั้งหมดโดยสหกรณ์ไม่มีส่วนเกี่ยวข้องใดๆ ในการกระทำผิดดังกล่าว และหากสหกรณ์ได้รับความเสียหายใดๆ ผู้ใช้บริการตกลงชดใช้ค่าเสียหายที่เกิดขึ้นให้แก่สหกรณ์จนครบถ้วน</Text>
                            <Text style={loginStyles.modalText}>12. ผู้ใช้บริการสามารถกำหนดค่าในเครื่องโทรศัพท์มือถือให้ยินยอมเปิดเผยพิกัดในการทำรายการเพื่อประโยชน์ของผู้ใช้บริการในด้านความปลอดภัยและยินยอมให้สหกรณ์นำเสนอเกี่ยวกับผลิตภัณฑ์บริการและข้อเสนอพิเศษอื่นๆของสหกรณ์ให้แก่ผู้ใช้บริการได้</Text>
                            <Text style={loginStyles.modalText}>13. ผู้ใช้บริการสามารถดูข้อมูลการทำรายการการชำระเงิน/โอนเงินย้อนหลังได้ ทั้งนี้ ผู้ใช้บริการจะได้รับหลักฐานการทำรายการชำระเงิน/โอนเงิน และสามารถของหลักฐานการทำรายการชำระเงิน/โอนเงินย้อนหลัง ได้ที่สหกรณ์อิสลามอิบนูเอาฟ ทุกสาขา “หลักฐานการทำรายการ” หมายถึง เอกสารหลักฐานอันได้แก่ ใบบันทึกรายการ ใบแจ้งการชำระเงิน/โอนเงิน ใบแจ้งรายการ(statement) และหลักฐานอื่นใดที่ทำด้วยเครื่องคอมพิวเตอร์และสื่อบันทึกข้อมูลหรือสื่อบันทึกข้อมูลอื่นใดที่ใช้เก็บข้อมูล หรือหลักฐานอื่นใดที่สหกรณ์ได้กำหนดขึ้นในอนาคต</Text>
                            <Text style={loginStyles.modalText}>14. ข้อมูลด้านการเงินการบัญชีหรือข้อมูลข่าวสารใดที่สหกรณ์จัดส่งให้ผู้ใช้บริการผ่านทางโทรศัพท์มือถือ ภายใต้บริการนี้ถือเป็นข้อมูลลับที่ผู้ใช้บริการไม่พึงเปิดเผยต่อบุคคลภายนอก</Text>
                            <Text style={loginStyles.modalText}>15. ผู้ใช้บริการตกลงยินยอมให้สหกรณ์หักเงินจากบัญชีเงินฝากของผู้ใช้บริการ เพื่อให้สหกรณ์ดำเนินการตามคำสั่งของผู้ใช้บริการภายใต้บริการต่างๆ ตามวิธีการแห่งข้อตกลงฉบับนี้โดยจะไม่ยกเลิกเพิกถอนจนกว่าจะมีการยกเลิกการใช้บริการนี้</Text>
                            <Text style={loginStyles.modalText}>16. การให้บริการและดำเนินการที่เกี่ยวข้องตลอดจนช่องทางการให้บริการต่างๆ ที่สหกรณ์จัดทำขึ้นเป็นการอำนวยความสะดวกให้กับผู้ใช้บริการ ความรับผิดตามธุรกรรมที่เกี่ยวข้องผู้ใช้บริการและสหกรณ์แต่ละฝ่ายต้องรับผิดชอบต่ออีกฝ่ายในความเสียหาย ที่เกิดขึ้นจากการที่ฝ่ายตนกระทำโดยผิดพลาดหรือประมาทเลินเล่อหรือปฏิบัติผิดข้อตกลงหรือการกระทำที่ไม่ ชอบด้วยกฎหมายแต่ไม่ต้องรับผิดชอบต่ออีกฝ่ายหนึ่งในความเสียหายที่เกิดจากเหตุสุดวิสัยหรือด้วยเหตุอื่นๆ ที่อยู่นอกเหนืออำนาจควบคุมสั่งการของฝ่ายตน ทั้งนี้ สหกรณ์มีความรับผิดชอบ (1) สหกรณ์ไม่ปฏิบัติตามคำสั่งระงับการชำระเงิน/โอนเงินที่มีข้อตกลงล่วงหน้า หรือไม่ระงับเครื่องมือการโอนเงินตามที่ได้รับแจ้งจากผู้ใช้บริการตามวิธีการและเงื่อนไขที่ระบุในข้อกำหนดแล ะเงื่อนไขการใช้บริการนี้ และต่อมาเกิดรายการชำระเงิน/โอนเงินผ่านบริการนี้ขึ้น หรือ (2) สหกรณ์ยังมิได้ส่งมอบเครื่องมือการโอนเงินให้แก่ผู้ใช้บริการและเกิดรายการชำระเงิน/โอนเงินผ่านบริการนี้โดย มิชอบขึ้น หรือ (3) เกิดรายการชำระเงิน/โอนเงินผ่านบริการนี้โดยมิชอบอันมิใช่ความผิดของผู้ใช้บริการ หรือ (4) สหกรณ์ไม่ปฏิบัติตามคำสั่งชำระเงิน/โอนเงินของผู้ใช้บริการจนเป็นเหตุให้ผู้รับชำระเงิน/ผู้รับโอนเงินไม่ได้รับเงินจากการชำระเงิน/โอนเงินโดยเสร็จสิ้นสมบูรณ์ตามวิธีการและเงื่อนไขที่ระบุในข้อกำหนดและเงื่อนไขการใช้บริการนี้เว้นแต่การไม่ปฏิบัติตามตำสั่งนั้นเกิดจากการที่ผู้ใช้บริการมีเงินในบัญชีไม่พอและ/หรือไม่มีหรือถูกระงับ ยอดเงินฝากจากการใช้วงเงินสินเชื่อกับสหกรณ์ และ/หรืออยู่ระหว่างการดำเนินทางกฎหมายและ/หรือสหกรณ์ได้แจ้งให้ผู้ใช้บริการทราบถึงความขัดข้องของการชำระเงิน/โอนเงินก่อนหรือในขณะทำการชำระเงิน/โอนเงินอยู่แล้วและ/หรือผู้ใช้บริการปฏิบัติผิดเงื่อนไขหรือข้อตกลงกับสหกรณ์</Text>
                            <Text style={loginStyles.modalText}>17. ผู้ใช้บริการยอมรับว่ากรณีเกิดรายการชำระเงิน/โอนเงินผ่านบริการนี้อันมีสาเหตุเครื่องมือการโอนเงิน สูญหายหรือถูกโจรกรรม ผู้ใช้บริการยอมรับผิดตามจำนวนเงินโอนนั้นที่เกิดก่อนสหกรณ์จะดำเนินการอายัตหรือระงับการใช้เครื่องมือการโอนเงินหรือการชำระเงิน/โอนเงินที่มีข้อตกลงล่วงหน้าแล้วเสร็จตามระยะเวลาที่ได้กำหนด</Text>
                            <Text style={loginStyles.modalText}>18. เมื่อผู้ใช้บริการเข้าใช้บริการนี้และระบบตรวจพบว่าโทรศัพท์มือถือของผู้ใช้บริการมีความเสี่ยงที่จะเกิด ความเสียหายอันเนื่องมาจากการดัดแปลงแก้ไขโทรศัพท์มือถือของผู้ใช้บริการเองหรือเกิดจากระบบเครือข่ายโทรศัพท์มือถือและ/หรือเหตุอื่นใด เช่น การ Jailbreak (“Jailbreak”หมายถึง การแก้ไขระบบหรือส่วนของระบบปฏิบัติการ ios ของโทรศัพท์มือถือที่ทำให้มีการเปลี่ยนแปลงสิทธิในการใช้งานของผู้ใช้โดยไม่ได้รับอนุญาตจากผู้ผลิต/เจ้าของร ะบบปฏิบัติการ)หรือ Root (“Root”หมายถึงการแก้ไขระบบหรือส่วนของระบบปฏิบัติการ Android ของโทรศัพท์มือถือที่ทำให้มีการเปลี่ยนแปลงสิทธิในการใช้งานของผู้ใช้โดยไม่ได้รับอนุญาตจากผู้ผลิต/เจ้าของร ะบบปฏิบัติการ) เป็นต้น ผู้ใช้บริการตกลงยินยอมให้สหกรณ์ระงับการใช้บริการต่างๆ ภายใต้บริการนี้ได้เป็นการชั่วคราวทันที โดยสหกรณ์ไม่ต้องแจ้งให้ผู้ใช้บริการทราบล่วงหน้า ทั้งนี้ เพื่อป้องกันความเสียหายที่อาจเกิดขึ้นกับผู้ใช้บริการ และผู้ใช้บริการยอมรับว่าการดำเนินการดังกล่าวของสหกรณ์เป็นการกระทำเพื่อความปลอดภัยและคุ้มครองป ระโยชน์ของผู้ใช้บริการและสหกรณ์ไม่ต้องรับผิดชอบในความเสียหายใดๆ ของผู้ใช้บริการ(ถ้ามี)</Text>
                            <Text style={loginStyles.modalText}>19. ในกรณีที่สหกรณ์มีความจำเป็นต้องเปิดเผยข้อมูลทางการเงินหรือธุรกรรมหรือข้อมูลใดๆ ที่เกี่ยวข้องกับการใช้บริการของผู้ใช้บริการคนใดคนหนึ่งหรือหลายคนให้แก่หน่วยงานใดๆ ภายใต้บทบัญญัติของกฎหมายคำสั่งหรือกฎระเบียบของหน่วยงานที่มีอำนาจหรือควบคุมกำกับดูแลสหกรณ์หรือเป็นการเปิดเผยข้อมูลให้แก่ผู้ชำระเงิน/ผู้รับโอนเงินหรือเป็นการเปิดเผยเพื่อประโยชน์ในการดำเนินการ/ให้บริการตามข้อตกลงและเงื่อนไขการใช้บริการนี้ ผู้ใช้บริการตกลงยินยอมให้สหกรณ์เปิดเผยหรือรายงานข้อมูลและ/หรือจัดทำรายงานเกี่ยวกับข้อมูลหรือธุรกรรมดังกล่าวของผู้ใช้บริการมอบให้แก่หน่วยงานนั้นได้ทุกประการและให้ความยินยอมนี้มีผลอยู่ตลอดไป แม้จะได้มีการยกเลิกการลงทะเบียน ยกเลิกการใช้บริการนี้ หรือปิดบัญชีนี้ก็ตาม</Text>
                            <Text style={loginStyles.modalText}>20. ผู้ใช้บริการรับรองว่าบรรดาเอกสาร ข้อมูล รายละเอียดใดๆ ที่ปรากฏและ/หรือที่ได้มีการจัดส่งมาให้สหกรณ์ ไม่ว่าจะส่งมาในรูปแบบใด และไม่ว่าจะส่งด้วยตัวผู้ใช้บริการเอง หรือบุคคลที่ผู้ใช้บริการมอบหมายเป็นข้อมูลของผู้ใช้บริการที่มีความครบถ้วน ถูกต้องแท้จริงและเป็นปัจจุบัน และเป็นข้อมูลที่สหกรณ์สามารถนำมาใช้ในการให้บริการและนำมาปรับปรุงข้อมูลในระบบของสหกรณ์ให้เป็น ปัจจุบันได้โดยผู้ใช้บริการมีสิทธิและมีความสามารถตามกฎหมายในการขอใช้บริการและการทำธุรกรรมใดๆ ที่เกี่ยวข้องกับการใช้บริการนี้ โดยสหกรณ์ไม่มีหน้าที่จะต้องตรวจสอบความถูกต้องแท้จริงหรือความสมบูรณ์ของเอกสารข้อมูลและรายละเอียดต่างๆ ดังกล่าว</Text>
                            <Text style={loginStyles.modalText}>21. หากผู้ใช้บริการมีความประสงค์จะขอแก้ไขข้อมูลและ/หรือรายละเอียดต่างๆ ผู้ใช้บริการจะต้องแจ้งให้สหกรณ์ทราบเป็นลายลักษณ์อักษรหรือตามวิธีการที่สหกรณ์กำหนด เว้นแต่จะมีระบุไว้เป็นอย่างอื่น ในกรณีที่ผู้ใช้บริการพบข้อผิดพลาดใดๆ จากการดำเนินการหรือในกรณีที่มีเหตุที่ต้องระงับการการดำเนินการภายใต้บริการนี้เป็นการชั่วคราวไม่ว่าทั้งหมดหรือบางส่วน หรือในกรณีการยกเลิกการระงับการดำเนินการดังกล่าวผู้ใช้บริการสามารถติดต่อสหกรณ์ได้ที่ Call Center หมายเลข 074-799003 เมื่อผู้ใช้บริการดำเนินการต่างๆ ตามกระบวนการที่สหกรณ์กำหนดครบถ้วนสมบูรณ์แล้ว สหกรณ์ตกลงดำเนินการ/ระงับการดำเนินการให้แล้วเสร็จตามระยะเวลาที่สหกรณ์ได้แจ้งแก่ผู้ใช้บริการนั้นโดย ผู้ใช้บริการยังคงเป็นผู้รับผิดชอบในการดำเนินการและรายการธุรกรรมที่ได้เกิดขึ้นก่อนครบกำหนดระยะเวลาที่ สหกรณ์จะมีการระงับการดำเนินการตามที่ได้รับแจ้งดังกล่าว ทั้งนี้ สหกรณ์ขอสงวนสิทธิในการเพิกเฉยต่อคำร้องขอใดๆ ที่ขัดต่อข้อกำหนด/หลักเกณฑ์ของสหกรณ์/ระเบียบทางราชการและ/หรือหน่วยงานอื่นใดที่มีอำนาจกำกับดูแลสหกรณ์ กรณีที่ผู้ใช้บริการพบข้อผิดพลาดใดๆ จากการชำระเงิน/โอนเงินหรือในกรณีที่มีเหตุที่ต้องระงับการดำเนินการภายใต้การบริการนี้ผู้ใช้บริกา รจะต้องให้ข้อมูลเรื่องวัน เวลา ผู้ที่เกี่ยวข้อง จำนวนเงินและลักษณะธุรกรรมหรือข้อมูลอื่นใดตามที่สหกรณ์จะร้องขอและสหกรณ์จะทำการสอบสวนตามที่ได้รับแจ้งตรวจสอบข้อเท็จจริงและแก้ไขข้อผิดพลาด(หากมี) โดยยึดหลักเกณฑ์ของทางราชการและ/หรือหน่วยงานที่มีอำนาจกำกับดูแลสหกรณ์</Text>
                            <Text style={loginStyles.modalText}>22. ผู้ใช้บริการตกลงชำระค่าธรรมเนียมการทำธุรกรรมต่างๆ ผ่านบริการนี้ให้แก่สหกรณ์ตามกำหนดเวลาและอัตราที่สหกรณ์กำหนดและตกลงเป็นผู้รับผิดชอบในค่าภาษีค่าอากรและค่าใช้จ่ายต่างๆ ที่เกิดขึ้นอันเนื่องมาจากการใช้บริการ ทั้งนี้ผู้ใช้บริการยินยอมให้หักเงินจากบัญชีเงินฝากของผู้ใช้บริการที่มีอยู่กับสหกรณ์เพื่อชำระหนี้และ/หรือความ รับผิดชอบของผู้ใช้บริการที่มีต่อสหกรณ์</Text>
                            <Text style={loginStyles.modalText}>23. ในกรณีที่สหกรณ์ไม่สามารถหักเงินจากบัญชีของผู้ใช้บริการเพื่อชำระค่าธรรมเนียมการทำธุรกรรมผ่านบริการ รวมถึงค่าภาษีค่าอากรแสตมป์และค่าใช้จ่ายต่างๆ ที่เกิดขึ้นอันเนื่องมาจากการทำธุรกรรมนั้นๆ ได้ ผู้ใช้บริการจะไม่สามารถทำธุรกรรมในครั้งนั้นๆ ผ่านบริการได้</Text>
                            <Text style={loginStyles.modalText}>24. ผู้ใช้บริการยินยอมชำระค่าธรรมเนียมการเชื่อมต่ออินเทอร์เน็ตจากการใช้บริการนี้นอกเหนือจากการใช้บริการโทรศัพท์มือถือตามปกติ(Air Time) โดยกรณีที่เป็นโทรศัพท์มือถือแบบจ่ายรายเดือน(Post-paid) ผู้ใช้บริการสามารถตรวจสอบยอดค่าธรรมเนียมได้จากใบแจ้งหนี้ (Statement) ของผู้ให้บริการเครือข่ายโทรศัพท์มือถือ ส่วนกรณีโทรศัพท์มือถือแบบเติมเงิน(Pre-paid) ผู้ใช้บริการสามารถตรวจสอบยอดค่าธรรมเนียมได้จากผู้ให้บริการเครือข่ายโทรศัพท์มือถือ</Text>
                            <Text style={loginStyles.modalText}>25. ผู้ใช้บริการตกลงยินยอมให้สหกรณ์มีสิทธิเปลี่ยนแปลงข้อกำหนดและเงื่อนไขการใช้บริการต่างๆ ได้ตามแต่จะเห็นสมควรโดยให้ถือว่าเป็นส่วนหนึ่งของข้อกำหนดและเงื่อนไขการใช้บริการฉบับนี้ด้วย นอกจากนี้สหกรณ์มีสิทธิที่จะระงับและ/หรือเปลี่ยนแปลงและ/หรือยกเลิกการให้บริการนี้ได้ไม่ว่าทั้งหมดหรือ บางส่วนหรือเฉพาะแต่ผู้ใช้บริการรายใดรายหนึ่งเมื่อใดก็ได้ โดยสหกรณ์จะแจ้งให้ทราบล่วงหน้า ทั้งนี้หากผู้ใช้บริการที่ไม่เข้าใช้งานระบบครั้งแรกเกินกว่า 30 (สามสิบ) วัน นับจากวันที่ขั้นตอนการสมัครใช้บริการเสร็จสิ้น ผู้ใช้บริการตกลงยินยอมให้สหกรณ์ยกเลิกการสมัครใช้บริการนี้โดยไม่ต้องแจ้งให้ทราบล่วงหน้าและเมื่อผู้ใช้บริ การได้เข้าใช้ระบบครั้งแรกแล้ว หากผู้ใช้บริการไม่เข้าใช้งานระบบเป็นระยะเวลานานเกินกว่า 1 (หนึ่ง) ปี ผู้ใช้บริการตกลงยินยอมให้สหกรณ์ระงับการใช้บริการได้ทันที อนึ่ง ในกรณีดังต่อไปนี้ ผู้ใช้บริการตกลงยินยอมให้เป็นดุลยพินิจของสหกรณ์ในการพิจารณาระงับการให้บริการและ/หรือเปลี่ยนแปลง การให้บริการและ/หรือยกเลิกการให้บริการไม่ว่าทั้งหมดหรือบางส่วนได้ตามที่สหกรณ์เห็นสมควรได้ทันที</Text>
                            <Text style={[loginStyles.modalText, { marginLeft: 25 }]}>25.1. คำรับรองหรือคำยืนยันใดๆ ที่ผู้ใช้บริการให้ไว้เป็นคำรับรองหรือคำยืนยันที่ไม่เป็นความจริงหรือพิสูจน์ได้ว่าไม่เป็นความจริงไม่ถูกต้ องหรือก่อให้เกิดความเข้าใจผิดในสาระสำคัญ</Text>
                            <Text style={[loginStyles.modalText, { marginLeft: 25 }]}>25.2. ปรากฏข้อเท็จจริงที่สหกรณ์เชื่อได้ว่าข้อมูลและ/หรือรายละเอียดต่างๆ ที่ผู้ใช้บริการแจ้งแก่สหกรณ์ให้ดำเนินการตามบริการนี้หรือการใช้บริการของผู้ใช้บริการมีผลกระทบใน ทางที่ไม่เป็นคุณเกิดขึ้นหรือกระทบต่อสิทธิของสหกรณ์หรือบุคคลอื่นหรือขัดต่อความสงบเรียบร้อยหรือศีลธรร มอันดีของประชาชนหรือทำให้สหกรณ์เชื่อได้หรือมีความเสี่ยงว่าผู้ใช้บริการจะมีหรือมีวัตถุประสงค์อันมิชอบตา มกฎหมาย</Text>
                            <Text style={[loginStyles.modalText, { marginLeft: 25 }]}>25.3. ผู้ใช้บริการปฏิบัติผิดข้อตกลงและเงื่อนไขการใช้บริการไม่ว่าข้อหนึ่งข้อใด ซึ่งรวมถึงการไม่ชำระค่าธรรมเนียมค่าบริการ ค่าภาษี ค่าอากรแสตมป์ และค่าใช้จ่ายต่างๆด้วย</Text>
                            <Text style={[loginStyles.modalText, { marginLeft: 25 }]}>25.4. สหกรณ์ต้องปฏิบัติตามกฎหมาย ระเบียบ ข้อบังคับ หรือคำสั่งและ/หรือการขอความร่วมมือของศาลหรือผู้มีอำนาจตามกฎหมายหรือหน่วยงานที่กำกับดูแลสหกรณ์ ในกรณีที่ผู้ใช้บริการต้องการยกเลิกการใช้บริการ ผู้ใช้บริการสามารถแจ้งยกเลิกผ่านช่องทาง Call Center (074-799003) หรือช่องทางอื่นๆ ตามที่สหกรณ์กำหนดและดำเนินการต่างๆ ตามกระบวนการของสหกรณ์ โดยสหกรณ์จะดำเนินการยกเลิกการใช้บริการตามความประสงค์ของผู้ใช้บริการโดยเร็ว โดยการยกเลิกจะมีผลสมบูรณ์เมื่อผู้ใช้บริการได้รับข้อความ SMS หรือช่องทางอื่นตามที่สหกรณ์กำหนดในการยืนยันการยกเลิกบริการ</Text>
                            <Text style={loginStyles.modalText}>26. ในกรณีที่มีเหตุสุดวิสัยหรือเหตุอื่นใดอันทำให้สหกรณ์ไม่สามารถดำเนินการให้บริการตามข้อกำหนดและเงื่อนไขการใช้บริการฉบับนี้ได้ ผู้ใช้บริการตกลงให้สหกรณ์พิจารณาให้บริการหรือดำเนินการตามที่เห็นสมควรเพื่อให้บริการตามข้อกำหนดและเงื่อนไขการใช้บริการฉบับนี้ได้ โดยผู้ใช้บริการตกลงยินยอมที่จะให้ความร่วมมือแก่สหกรณ์อย่างเต็มที่และทุกวิถีทางในการปรับปรุงวิธีการของสหกรณ์เพื่อความสะดวกของผู้ใช้บริการในบริการต่างๆ ตามข้อกำหนดและเงื่อนไขการใช้บริการฉบับนี้</Text>
                            <Text style={loginStyles.modalText}>27. การล่าช้าหรืองดเว้นใดๆ ในการใช้สิทธิของสหกรณ์ตามกฎหมายหรือตามเงื่อนไขต่างๆ ตลอดจนคู่มือระเบียบและบันทึกเสียงของสหกรณ์ในระบบโทรศัพท์ไม่ถือว่าสหกรณ์สละสิทธิหรือให้ความยินยอมในการดำเนินการใดๆ แก่ผู้ใช้บริการแต่ประการใด</Text>
                            <Text style={loginStyles.modalText}>28. บรรดาหนังสือ จดหมายคำบอกกล่าวใดๆ ที่สหกรณ์ได้ส่งให้ผู้ใช้บริการตามที่อยู่ที่แจ้งไว้กับสหกรณ์นั้นไม่ว่าจะโดยส่งเอง หรือส่งทางไปรษณีย์ลงทะเบียนหรือไม่ลงทะเบียนหรือส่งผ่าน E-mail address หรือ Short Message Service (SMS) ไปยังหมายเลขโทรศัพท์มือถือที่ผู้ใช้บริการแจ้งไว้กับสหกรณ์ ให้ถือว่าได้ส่งให้แก่ผู้ใช้บริการโดยชอบแล้ว ทั้งนี้โดยไม่ต้องคำนึงถึงว่าจะมีผู้รับไว้หรือไม่และแม้ว่าส่งให้ไม่ได้เพราะย้ายที่อยู่หรือที่อยู่เปลี่ยนแปลงไปหรือถู กรื้อถอนไปโดยไม่ได้แจ้งการย้ายการเปลี่ยนแปลงหรือการรื้อถอนนั้นเป็นหนังสือให้สหกรณ์ทราบก็ดีหรือส่งให้ ไม่ได้เพราะหาที่อยู่ตามที่ระบุนั้นไว้ไม่พบก็ดี ให้ถือว่าผู้ใช้บริการได้รับและทราบหนังสือ จดหมายหรือคำบอกกล่าวดังกล่าวแล้วโดยชอบ ทั้งนี้หากมีการเปลี่ยนแปลงที่อยู่หรือสถานที่ทำงานหรือเปลี่ยนอาชีพการงาน ผู้ใช้บริการจะต้องแจ้งการเปลี่ยนแปลงให้สหกรณ์ทราบเป็นลายลักษณ์อักษรทันที</Text>
                            <Text style={loginStyles.modalText}>29. ผู้ใช้บริการตกลงผูกพันและปฏิบัติตามข้อกำหนดและเงื่อนไขการใช้บริการฉบับนี้ และตกลงชำระค่าธรรมเนียม ค่าบริการและค่าใช้จ่ายใดๆ ที่เกี่ยวข้องกับการใช้บริการนี้ตามที่สหกรณ์กำหนดและแจ้งให้ผู้ใช้บริการทราบโดยประกาศเป็นการทั่วไปผ่าน ช่องทางต่างๆ ของสหกรณ์ทั้งที่มีอยู่แล้วในขณะนี้ และที่สหกรณ์จะกำหนดขึ้นใหม่หรือเปลี่ยนแปลงในภายหน้าตามที่สหกรณ์เห็นสมควรทุกประการ ทั้งนี้ผู้ใช้บริการรับทราบและตกลงว่าเป็นสิทธิและดุลยพินิจโดยลำพังของสหกรณ์ที่จะเปลี่ยนแปลงอัตราค่าธรร มเนียมค่าบริการ และค่าใช้จ่าย และ/หรือวิธีการคำนวณตามที่สหกรณ์พิจารณาเห็นสมควรเมื่อใดก็ได้โดยสหกรณ์จะแจ้งให้ผู้ใช้บริการทราบหรือปิดประกาศไว้ ณ ที่ทำการสาขา หรือเว็บไซต์ของสหกรณ์ล่วงหน้าไม่น้อยกว่า 30 (สามสิบ) วัน ก่อนที่การเปลี่ยนแปลงจะมีผลใช้บังคับ โดยให้ถือเป็นส่วนหนึ่งของข้อกำหนดและเงื่อนไขนี้ด้วย เว้นแต่การเปลี่ยนแปลงนั้น ทำให้ผู้ใช้บริการได้รับประโยชน์ สหกรณ์ไม่จำเป็นต้องบอกกล่าวให้ทราบล่วงหน้าแต่อย่างใด และถือว่าผู้ใช้บริการตกลงยินยอมด้วยทุกประการ</Text>
                            <Text style={loginStyles.modalText}>30. ข้อกำหนดและเงื่อนไขการใช้บริการฉบับนี้ให้ใช้บังคับและตีความตามกฎหมายไทย และให้ศาลไทยเป็นศาลที่มีเขตอำนาจในการพิจารณาข้อพิพาทที่เกิดขึ้นตามข้อตกลงฉบับนี้</Text>

                            {/* เมื่อผู้ใช้ 'ยอมรับ' ให้ปิด modal และลิ้งไปยังหน้า CreatePassword พร้อมกับส่งค่า MEM ไปด้วย */}
                            <Pressable
                                style={[loginStyles.button, loginStyles.acceptButton]}
                                onPress={() => {
                                    setModalVisible(false)
                                    setShowAlert(false)
                                    navigation.reset({
                                        index: 0,
                                        routes: [
                                            {
                                                name: 'CreatePassword',
                                                params: { MEM: shareNumber }
                                            }
                                        ]
                                    })
                                }}
                            >
                                <Text style={loginStyles.textStyle}>ยอมรับ</Text>
                            </Pressable>

                            <Pressable
                                style={[loginStyles.button, loginStyles.notAcceptButton]}
                                onPress={() => setModalVisible(!modalVisible)}
                            >
                                <Text style={loginStyles.textStyle}> ไม่ยอมรับ</Text>
                            </Pressable>
                        </ScrollView>
                    </View>
                </View>
            </Modal>

            {/* ส่วนของการ alert */}
            <AppAlert
                visible={showAlert}
                title={alertMessage === '' ? alertMessage : ' ไม่สำเร็จ'}
                message={alertMessage === '' ? 'Loading...' : alertMessage}
                showConfirm={alertMessage !== ''}
                showCancel={false}
                onConfirm={onConfirmPressed}
                onCancel={() => setShowAlert(false)}
            />

        </LoginLayout >
    )
}

export default RegisterScreen